IDEA Open Model
ConcreteULSCheckResultInteractionEc2.CheckValueShearAndTorsion Property
Compatible with IDEA StatiCa Beta 20.0
 Calculated value of the exploitation of the cross-section (for interaction of shear and torsion) related to the limit value
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public double CheckValueShearAndTorsion { get; set; }
Public Property CheckValueShearAndTorsion As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ConcreteULSCheckResultInteractionEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace